[
{"product_name": "WholeHearted Chicken Recipe Puree Squeezable Cat Treats, 0.5 oz., Count of 4", "price_usd": 1.82, "brand_name": "WholeHearted", "ratings": 4.6, "product_labels": "Natural Cat Treats", "ingredient_formula": "Chicken Broth, Chicken, Tapioca Starch, Natural Flavor, Vitamin E Supplement."},
{"product_name": "WholeHearted Savory & Tasty Soft Cat Treats - Salmon Recipe, 3 OZ", "price_usd": 3.29, "brand_name": "WholeHearted", "ratings": 3.5, "product_labels": "Natural Cat Treats", "ingredient_formula": "Salmon, Potato, Oatmeal, Maple Syrup, Vegetable Glycerin, Gelatin, Ascorbic Acid (preservative), Citric Acid (preservative), Lecithin, Mixed Tocopherols (preservative), Vitamin A Palmitate, Riboflavin (source of Vitamin B2), Pyridoxine Hydrochloride (source of Vitamin B6), Vitamin B12 Supplement, Ascrorbic Acid (Vitamin C), Cholecalciferol (source of Vitamin D3), d-Alpha Tocopherols (source of Vitamin E), Rosemary Extract."},
{"product_name": "Greenies Smartbites Healthy Indoor Tuna Flavor Natural Treats For Cats, 16 oz.", "price_usd": 19.98, "brand_name": "Greenies", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken Meal, Animal Fat (Preserved with Mixed Tocopherols), Brewers Rice, Ground Whole Wheat, Wheat Flour, Animal Plasma, Powdered Cellulose, Natural Flavor, Dried Plain Beet Pulp, Brewers Dried Yeast, Fruit Juice Color, Potassium Chloride, Choline Chloride, Dicalcium Phosphate, Salt, Taurine, DL-Methionine, Calcium Carbonate, Vitamin E Supplement, Zinc Sulfate, Mixed Tocopherols (preservative), Natural Tuna Flavor, Turmeric Color, Citric Acid, Ferrous Sulfate, Copper Sulfate, Vitamin A Supplement, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement (Vitamin B2), Rosemary Extract, Manganese Sulfate, Thiamine Mononitrate (Vitamin B1), D-Calcium Pantothenate (Vitamin B5), Pyridoxine Hydrochloride (Vitamin B6), Vitamin D3 Supplement, Biotin, Potassium Iodide, Folic Acid."},
{"product_name": "Inaba Churu Chicken Variety Pack Cat Treats, 25 oz., Count of 50", "price_usd": 31.19, "brand_name": "Inaba", "ratings": 4.9, "product_labels": "Soft & Chewy Cat Treats", "ingredient_formula": "Chicken: Water, Chicken, Tapioca Starch, Natural Flavors, Natural Scallop Flavor, Guar Gum, Vitamin E Supplement, Taurine, Green Tea Extract. Chicken with Cheese: Water, Chicken, Cheese (Milk, Water, Phosphoric acid), Tapioca Starch, Natural Flavors, Natural Chicken Flavor, Guar Gum, Vitamin E Supplement, Taurine, Green Tea Extract. Chicken with Scallop: Water, Chicken, Tapioca Starch, Scallop, Natural Flavors, Natural Scallop Flavor, Guar Gum, Vitamin E Supplement, Taurine, Green Tea Extract. Chicken with Shrimp: Water, Chicken, Tapioca Starch, Natural Flavors, Guar Gum, Natural Shrimp Flavor, Vitamin E Supplement, Taurine, Green Tea Extract."},
{"product_name": "Leaps & Bounds Safari Mice Cat Toys with Catnip, Pack of 3", "price_usd": 5.99, "brand_name": "Leaps & Bounds", "ratings": 4.5, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "Blue Buffalo Bursts Feline Chicken Flavour Cat Treats, 12 oz.", "price_usd": 8.98, "brand_name": "Blue Buffalo", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Deboned Chicken, Chicken Meal, Chicken Fat, Brown Rice, Barley, Tapioca Starch, Oatmeal, Peas, Natural Flavor, Brewers Dried Yeast, Pork Fat, Dried Whey, Lecithin, preserved with Citric Acid and Mixed Tocopherols, Dried Cultured Whey, Glucono-Delta-Lactone, Potassium Chloride, Yeast Extract, DL-Methionine, Taurine, Oil of Rosemary."},
{"product_name": "Wellness Kittles Crunchy Natural Grain Free Chicken & Cranberry Cat Treats, 2 oz", "price_usd": 2.37, "brand_name": "Wellness", "ratings": 4.7, "product_labels": "Cat Treats", "ingredient_formula": "Deboned Chicken, Chicken Meal, Potatoes, Chickpeas, Peas, Whitefish Meal, Cranberries, Blueberries, Chicken Fat (preserved with Mixed Tocopherols), Natural Flavor, Ground Flaxseed, Salmon Oil, Rosemary Extract, Green Tea Extract."},
{"product_name": "Leaps & Bounds Little Paws Teething Mouse Kitten Toy with Catnip", "price_usd": 4.99, "brand_name": "Leaps & Bounds", "ratings": 3.8, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "PureBites Squeezable Skin & Coat Creamy Cat Treats, 2.5 oz.", "price_usd": 2.19, "brand_name": "PureBites", "ratings": 4.9, "product_labels": "Cat Food Pouches", "ingredient_formula": "Chicken, water, tapioca starch, sunflower oil, tuna oil."},
{"product_name": "Blue Buffalo Bursts Feline Seafood Flavour Cat Treats, 12 oz.", "price_usd": 8.98, "brand_name": "Blue Buffalo", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Deboned Salmon, Brown Rice, Tuna Meal, Barley, Pork Fat, Tapioca Starch, Oatmeal, Salmon Meal, Natural Flavor, Deboned Cod, Peas, Shrimp, Canola Oil, Brewers Dried Yeast, Dried Whey, Lecithin, preserved with Citric Acid and Mixed Tocopherols, Dried Cultured Whey, Glucono-Delta-Lactone, Potassium Chloride, Yeast Extract, DL-Methionine, Taurine, Oil of Rosemary."},
{"product_name": "Blue Buffalo Blue Wilderness Chicken & Turkey Cat Treats, 2 oz.", "price_usd": 2.96, "brand_name": "Blue Buffalo", "ratings": 4.5, "product_labels": "Grain Free Cat Treats", "ingredient_formula": "Deboned Chicken, Deboned Turkey, Potatoes, Vegetable Glycerin, Gelatin, Natural Flavor, Salt, preserved with Phosphoric Acid, Sorbic Acid, Citric Acid and Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "PureBites Freeze Dried Shrimp Cat Treats, 0.8 oz.", "price_usd": 11.59, "brand_name": "PureBites", "ratings": 4.5, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "American Sourced Wild-Caught Human Grade Shrimp."},
{"product_name": "Leaps & Bounds Fuzzy Mice Cat Toys with Catnip, Medium, Pack of 12", "price_usd": 12.99, "brand_name": "Leaps & Bounds", "ratings": 4.6, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "Gimborn CatA'bout Cat Grass Plus", "price_usd": 6.99, "brand_name": "Gimborn", "ratings": 4.3, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "Tiki Cat Baby Soft & Chewy Chicken Flavored Wet Cat Treats, 2 oz.", "price_usd": 3.59, "brand_name": "Tiki Cat", "ratings": 4.1, "product_labels": "Kitten Treats", "ingredient_formula": "Chicken, chickpea flour, tuna, vegetable glycerin, whole ground potatoes, tapioca starch, sugar, natural chicken flavor, gelatin, menhaden fish oil, citric acid (preservative), vinegar, salt, phosphoric acid, mixed tocopherols (preservative), rosemary extract."},
{"product_name": "Friskies Natural Party Mix Yums With Real Salmon Cat Treats, 20 oz.", "price_usd": 5.99, "brand_name": "Friskies", "ratings": 4.9, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Fish, Chicken Meal, Rice, Poultry By-product Meal, Corn Gluten Meal, Animal Fat Preserved With Mixed-tocopherols, Wheat Flour, Natural Flavor, Pea Starch, Barley, Salmon, Dried Yeast, Phosphoric Acid, Malted Barley Extract, Calcium Carbonate, Potassium Chloride, Salt, Choline Chloride, Dehydrated Seaweed Meal, Sunflower Meal, Vitamins (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Dried Carrots, Dried Peas, Minerals (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Taurine, Citric Acid. E623118."},
{"product_name": "Blue Buffalo Blue Wilderness Chicken Flavor Crunchy Cat Treats, 2 oz.", "price_usd": 1.94, "brand_name": "Blue Buffalo", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Deboned Chicken, Chicken Meal, Potato Starch, Peas, Brewers Dried Yeast, Chicken Fat, Natural Flavor, Citric Acid, Potassium Chloride, preserved with Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "Fancy Feast Savory Cravings Limited Ingredient Tuna Flavor Cat Treats, 1 oz.", "price_usd": 2.99, "brand_name": "Fancy Feast", "ratings": 4.3, "product_labels": "Cat Treats", "ingredient_formula": "Liver Flavor, Beef Fat Preserved With Mixed-Tocopherols, Partially Hydrogenated Vegetable Oil, Brewers Dried Yeast, Tuna Flavor. A642421."},
{"product_name": "Applaws Natural Whole Tuna Loin Cat Treat, 1.06 oz.", "price_usd": 3.39, "brand_name": "Applaws", "ratings": 4.9, "product_labels": "Natural Cat Treats", "ingredient_formula": "Tuna Loin."},
{"product_name": "WholeHearted Chicken Flavor Soft-Filled Bites Cat Treats, 30 oz.", "price_usd": 16.99, "brand_name": "WholeHearted", "ratings": 4.3, "product_labels": "Soft & Chewy Cat Treats", "ingredient_formula": "Chicken Meal, Potato Starch, Rice Flour, Bone Marrow Fat, Chicken, Tapioca, Chicken Fat (Preserved with Mixed Tocopherols), Natural Flavors, Citric Acid, Sorbic Acid (Preservative), Added Color (Caramel)."},
{"product_name": "WholeHearted Turkey Liver Freeze-Dried Cat Treats, 2 oz.", "price_usd": 8.99, "brand_name": "WholeHearted", "ratings": 4.8, "product_labels": "Canned Cat Food", "ingredient_formula": "Turkey liver."},
{"product_name": "Petstages Crunchy Pickle Kicker Dental Catnip Cat Toy, Medium", "price_usd": 5.59, "brand_name": "Petstages", "ratings": 4.4, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "Greenies Pill Pockets Catnip Flavor Natural Soft Cat Treats, 1.6 oz., Pack of 45", "price_usd": 6.48, "brand_name": "Greenies", "ratings": 4.5, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Chicken, Glycerin, Wheat Flour, Wheat Gluten, Natural Catnip Flavor, Vegetable Oil, Dried Corn Syrup, Natural Flavor, Dried Chicken Liver, Vinegar, Sodium Bisulfate, Mixed Tocopherols and Citric Acid (preservatives), Rosemary Extract."},
{"product_name": "Blue Buffalo Baby Blue Crunchies Natural Grain Free Savory Salmon Kitten Treats, 2 oz.", "price_usd": 2.09, "brand_name": "Blue Buffalo", "ratings": 4.7, "product_labels": "Kitten Treats", "ingredient_formula": "Salmon, Chicken Meal, Potato Starch, Peas, Brewers Dried Yeast, Chicken Fat, Natural Flavor, Citric Acid, Potassium Chloride, preserved with Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "WholeHearted Protein-Rich Chicken Filet Cat Treat, 1.06 oz.", "price_usd": 2.52, "brand_name": "WholeHearted", "ratings": 4.8, "product_labels": "Natural Cat Treats", "ingredient_formula": "Chicken, Water sufficient for processing, Tapioca starch, Salt, Celery powder."},
{"product_name": "Fancy Feast Limited Ingredient Savory Cravings Salmon Flavor Cat Treats, 3 oz.", "price_usd": 4.99, "brand_name": "Fancy Feast", "ratings": 4.5, "product_labels": "Soft & Chewy Cat Treats", "ingredient_formula": "Liver Flavor, Beef Fat Preserved With Mixed-Tocopherols, Partially Hydrogenated Vegetable Oil, Brewers Dried Yeast, Natural Salmon Flavor. A642319."},
{"product_name": "Tomlyn Laxatone Catnip Flavored Hairball Lubricant", "price_usd": 10.99, "brand_name": "Tomlyn", "ratings": 4.3, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Hydrolyzed Corn Starch, Malt Syrup, White Petroleum Usp, Molasses Extract, Soybean Oil, Light Mineral Oil Nf, Water, Hydrolyzed Collagen, Sodium Benzoate (Preservative), Natural And Artificial Flavors."},
{"product_name": "Tiki Cat Stix Tuna Mousse Cat Treats, 0.5 oz., Count of 6", "price_usd": 4.94, "brand_name": "Tiki Cat", "ratings": 4.7, "product_labels": "Grain Free Cat Treats", "ingredient_formula": "Tuna broth, tuna, dried egg, natural tuna flavor, natural chicken flavor, xanthan gum, fish extract, salt."},
{"product_name": "Temptations Creamy Puree with Chicken and Salmon Lickable, Squeezable Cat Treats Variety Pack, 6.7 oz., Count of 16", "price_usd": 8.98, "brand_name": "Temptations", "ratings": 4.8, "product_labels": "Cat Treats", "ingredient_formula": "Chicken: Water, Chicken Liver, Chicken by-Product, Chicken, Pork Liver, Pork by-Product, Vegetable Oil, Glycine, Tapioca Starch, Dried Milk Protein, Xanthan Gum, Sodium Carboxymethylcellulose, Guar Gum, Cysteine, Taurine. Salmon: Water, Chicken Liver, Chicken by-Product, Salmon, Chicken, Pork Liver, Pork by-Product, Vegetable Oil, Glycine, Tapioca Starch, Dried Milk Protein, Xanthan Gum, Sodium Carboxymethylcellulose, Guar Gum, Cysteine, Taurine Please reference ingredient image for complete ingredient list."},
{"product_name": "Blue Buffalo Blue Wilderness Chicken & Salmon Cat Treats, 2 oz.", "price_usd": 2.98, "brand_name": "Blue Buffalo", "ratings": 4.5, "product_labels": "Grain Free Cat Treats", "ingredient_formula": "Deboned Chicken, Deboned Salmon, Potatoes, Vegetable Glycerin, Gelatin, Natural Flavor, Salt, preserved with Phosphoric Acid, Sorbic Acid, Citric Acid and Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "Greenies Pill Pockets Chicken Flavor Natural Soft Cat Treats, 3 oz.", "price_usd": 10.98, "brand_name": "Greenies", "ratings": 4.1, "product_labels": "Cat Treats", "ingredient_formula": "Chicken, Glycerin, Wheat Flour, Wheat Gluten, Vegetable Oil, Dried Corn Syrup, Natural Flavor, Dried Chicken Liver, Vinegar, Sodium Bisulfate, Mixed Tocopherols and Citric Acid (preservatives), Rosemary Extract."},
{"product_name": "Greenies Natural Catnip Flavor Adult Dental Cat Treats, 2.1 oz.", "price_usd": 3.28, "brand_name": "Greenies", "ratings": 4.6, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Chicken Meal, Ground Wheat, Brewers Rice, Corn Gluten Meal, Poultry Fat (preserved with Mixed Tocopherols), Oat Fiber, Natural Flavor, Ground Flaxseed, Brewers Dried Yeast, Potassium Chloride, Calcium Carbonate, Salt, Dried Catnip, Choline Chloride, Citric Acid (a preservative), Fruit Juice Color, Taurine, DL-Methionine, Mixed Tocopherols (a preservative), Vitamin E Supplement, Ferrous Sulfate, Turmeric Color, Zinc Sulfate, Niacin Supplement, Zinc Oxide, Copper Sulfate, D-Calcium Pantothenate (Vitamin B5), Vitamin A Supplement, Thiamine Mononitrate (Vitamin B1), Manganous Oxide, Riboflavin Supplement (Vitamin B2), Pyridoxine Hydrochloride (Vitamin B6), Biotin, Vitamin B12 Supplement, Vitamin D3 Supplement, Sodium Selenite, Folic Acid, Calcium Iodate, Cobalt Carbonate, Rosemary Extract."},
{"product_name": "Temptations MixUps Crunchy and Soft Cat Treats, Surfer's Delight Flavor, 30 oz.", "price_usd": 15.48, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Natural Tuna Shrimp & Salmon Flavor, Red #40, Mixed Tocopherols (Preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Temptations Seasonal Lobster and Beef Flavor Birthday Cat Treats, 6.3 oz.", "price_usd": 3.98, "brand_name": "Temptations", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Brewers Dried Yeast, Natural Flavors, Potassium Chloride, Choline Chloride, Caramel Color, Salt, Taurine, DL-Methionine, Calcium Carbonate, Red #40, Vitamin E Supplement, Zinc Sulfate, Natural Beef Flavor, Natural Lobster Flavor, Ferrous Sulfate, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Citric Acid (preservative), Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Pyridoxine Hydrochloride (Vitamin B6), Vitamin D3 Supplement, Rosemary Extract, Biotin, Potassium Iodide, Folic Acid Please reference ingredient image for complete ingredient list."},
{"product_name": "KONG Refillables Hedgehog Cat Toy", "price_usd": 6.99, "brand_name": "KONG", "ratings": 4.8, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "WholeHearted Salmon Freeze-Dried Cat Treats, 2 oz.", "price_usd": 9.99, "brand_name": "WholeHearted", "ratings": 3.9, "product_labels": "Cat Treats", "ingredient_formula": "Salmon."},
{"product_name": "Temptations Jumbo Stuff Tasty Chicken Flavor Crunchy and Soft Cat Treats, 14 oz.", "price_usd": 8.48, "brand_name": "Temptations", "ratings": 4.5, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Natural Salmon Flavor, Red #40, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid."},
{"product_name": "Leaps & Bounds Silvervine Sticks Cat Toy", "price_usd": 8.99, "brand_name": "Leaps & Bounds", "ratings": 4.0, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Not Provided"},
{"product_name": "Friskies Party Mix Natural Yums With Real Salmon and Vitamins, Minerals & Nutrients Cat Treats, 2.1 oz.", "price_usd": 1.89, "brand_name": "Friskies", "ratings": 4.9, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Fish, Chicken Meal, Rice, Poultry By-Product Meal , Animal Fat Preserved With Mixed-Tocopherols, Barley, Corn Gluten Meal, Wheat Flour, Pea Starch, Natural Flavors, Salmon, Dried Yeast, Phosphoric Acid, Malted Barley Extract, Potassium Chloride, Sunflower Oil, Calcium Carbonate, Salt, Choline Chloride, Dehydrated Seaweed Meal, Dried Carrots, Dried Peas, VITAMINS (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Taurine, MINERALS (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Citric Acid. F623120."},
{"product_name": "Blue Buffalo Blue Wilderness Chicken & Duck Cat Treats, 2 oz.", "price_usd": 4.49, "brand_name": "Blue Buffalo", "ratings": 4.8, "product_labels": "Cat Treats", "ingredient_formula": "Deboned Chicken, Deboned Duck, Potatoes, Vegetable Glycerin, Gelatin, Natural Flavor, Salt, preserved with Phosphoric Acid, Sorbic Acid, Citric Acid and Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "Blue Buffalo Blue Wilderness Salmon Crunchy Cat Treats, 12 oz.", "price_usd": 10.98, "brand_name": "Blue Buffalo", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Salmon, Chicken Meal, Potato Starch, Peas, Brewers Dried Yeast, Chicken Fat, Natural Flavor, Citric Acid, Potassium Chloride, preserved with Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "Temptations Classic Crunchy and Soft Cat Treats Tasty Chicken Flavor, 48 oz.", "price_usd": 23.98, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Natural Tuna Shrimp & Salmon Flavor, Red #40, Mixed Tocopherols (Preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Temptations Classic Hearty Beef Flavor Cats Treats, 6.3 oz.", "price_usd": 3.99, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Caramel Color, Potassium Chloride, Choline Chloride, Salt, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Natural Beef Flavor, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid."},
{"product_name": "Temptations Classics Tempting Tuna Flavor Crunchy and Soft Cat Treats, 30 oz.", "price_usd": 15.48, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Caramel Color, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Natural Tuna Flavor, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please reference ingredient image for complete ingredient list."},
{"product_name": "Blue Buffalo True Chews Natural Duck Chewy Cat Treats, 3 oz.", "price_usd": 4.98, "brand_name": "Blue Buffalo", "ratings": 4.5, "product_labels": "Natural Cat Treats", "ingredient_formula": "Duck, Chicken, Vegetable Glycerin, Pea Starch, Potatoes, Brewer's Dried Yeast, Dried Chicken Liver, Pea Protein, Chicken Broth, Oat Fiber, Gelatin, Natural Flavors, Distilled Vinegar, Colored with Paprika"},
{"product_name": "WholeHearted Chicken Liver Freeze-Dried Cat Treats, 2 oz.", "price_usd": 9.59, "brand_name": "WholeHearted", "ratings": 4.4, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken Liver."},
{"product_name": "KONG 1OZ Premium Catnip", "price_usd": 5.99, "brand_name": "KONG", "ratings": 4.2, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "Blue Buffalo Blue Wilderness Salmon Flavor Crunchy Cat Treats, 2 oz.", "price_usd": 2.89, "brand_name": "Blue Buffalo", "ratings": 4.7, "product_labels": "Cat Treats", "ingredient_formula": "Salmon, Chicken Meal, Potato Starch, Peas, Brewers Dried Yeast, Chicken Fat, Natural Flavor, Citric Acid, Potassium Chloride, preserved with Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "Blue Buffalo Baby Blue Crunchies Natural Savory Chicken Kitten Treats, 2 oz.", "price_usd": 2.09, "brand_name": "Blue Buffalo", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Deboned Chicken, Chicken Meal, Brown Rice, Barley, Oatmeal, Peas, Chicken Fat, Natural Flavor, Glucono-Delta-Lactone, Potassium Chloride, preserved with Citric Acid and Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "WholeHearted Protein-Rich Tuna Filet Cat Treat, 1 oz.", "price_usd": 2.29, "brand_name": "WholeHearted", "ratings": 4.6, "product_labels": "Natural Cat Treats", "ingredient_formula": "Tuna"},
{"product_name": "Blue Buffalo Wilderness Chicken Crunchy Cat Treat, 12 oz.", "price_usd": 10.98, "brand_name": "Blue Buffalo", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Deboned Chicken, Chicken Meal, Potato Starch, Peas, Brewers Dried Yeast, Chicken Fat, Natural Flavor, Citric Acid, Potassium Chloride, preserved with Mixed Tocopherols, Oil of Rosemary."},
{"product_name": "Friskies Party Mix Gravylicious Crunch Chicken & Gravy Flavors Cat Treats, 6 oz.", "price_usd": 3.59, "brand_name": "Friskies", "ratings": 4.9, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Brewers Rice, Animal Fat Preserved With Mixed-Tocopherols, Corn Protein Meal, Animal Liver Flavor, Fish, Artificial And Natural Flavors, Turkey By-Product Meal, Phosphoric Acid, Calcium Carbonate, Dried Chicken Flavored Gravy, Brewers Dried Yeast, Salt, Choline Chloride, MINERALS (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Taurine, L-Ascorbyl-2-Polyphosphate (Vitamin C), VITAMINS (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Yellow 5, Red 40, Citric Acid, Blue 2, Bha (A Preservative), Bht (A Preservative). C623321."},
{"product_name": "Feline Greenies Natural Tempting Tuna Flavor Adult Dental Cat Treats, 21 oz.", "price_usd": 22.98, "brand_name": "Greenies", "ratings": 4.6, "product_labels": "Cat Dental Treats & Chews", "ingredient_formula": "Chicken Meal, Ground Wheat, Brewers Rice, Corn Gluten Meal, Poultry Fat (Preserved with Mixed Tocopherols), Oat Fiber, Natural Poultry Flavor, Ground Flaxseed, Brewers Dried Yeast, Tuna Flavor, Potassium Chloride, Calcium Carbonate, Salt, Choline Chloride, Citric Acid (a Preservative), Fruit Juice Color, Taurine, DL-Methionine, Mixed Tocopherols (a Preservative), DL-Alpha Tocopherol Acetate (Source of Vitamin E), Ferrous Sulfate, Turmeric Color, Zinc Sulfate, Niacin Supplement, Zinc Oxide, Copper Sulfate, D-Calcium Pantothenate (Vitamin B5), Vitamin A Supplement, Thiamine Mononitrate (Vitamin B1), Manganous Oxide, Riboflavin Supplement (Vitamin B2), Pyridoxine Hydrochloride (Vitamin B6), Biotin, Vitamin B12 Supplement, Vitamin D3 Supplement, Sodium Selenite, Folic Acid, Calcium Iodate, Cobalt Carbonate, Rosemary Extract."},
{"product_name": "Friskies Party Mix Lobster & Mac 'N' Cheese Flavors Cat Treats, 6 oz.", "price_usd": 3.58, "brand_name": "Friskies", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Please see product packaging for details."},
{"product_name": "Temptations Jumbo Stuff Tempting Tuna Flavor Crunchy and Soft Cat Treats, 14 oz.", "price_usd": 8.48, "brand_name": "Temptations", "ratings": 4.4, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Caramel Color, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Natural Tuna Flavor, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please reference ingredient image for complete ingredient list."},
{"product_name": "Whole Hearted Salmon Recipe Squeezable Puree Cat Treats, 0.5 oz., Count of 4", "price_usd": 2.99, "brand_name": "WholeHearted", "ratings": 4.8, "product_labels": "Freeze-Dried Treats", "ingredient_formula": "Water Sufficient For Processing, Salmon, Tapioca Starch, Sunflower Oil, Natural Flavor, Guar Gum"},
{"product_name": "PureBites Squeezable Gut & Digestion Creamy Cat Treats, 2.5 oz.", "price_usd": 2.19, "brand_name": "PureBites", "ratings": 4.2, "product_labels": "Cat Treats", "ingredient_formula": "Chicken, water, pumpkin, tapioca starch, inulin."},
{"product_name": "Friskies Party Mix California Crunch With Chicken Cat Treats, 6 oz.", "price_usd": 3.58, "brand_name": "Friskies", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken, Chicken Meal, Brewers Rice, Chicken By-Product Meal, Animal Fat Preserved With Mixed-Tocopherols, Pea Starch, Corn Protein Meal, Liver Flavor, Barley, Brewers Dried Yeast, Natural And Artificial Flavors, Cassava Root Flour, Turkey By-Product Meal, Phosphoric Acid, Calcium Carbonate, Potassium Chloride, Choline Chloride, Bacon Flavor, Salt, Taurine, L-Ascorbyl-2-Polyphosphate (Vitamin C), VITAMINS (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), MINERALS (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Yellow 5, Citric Acid, Yellow 6, Red 40, Blue 2, Bha (A Preservative), Bht (A Preservative). G619723."},
{"product_name": "Greenies Smartbites Healthy Indoor Chicken Flavor Natural Treats For Cats, 16 oz.", "price_usd": 19.98, "brand_name": "Greenies", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken Meal, Animal Fat (Preserved with Mixed Tocopherols), Brewers Rice, Ground Whole Wheat, Wheat Flour, Animal Plasma, Powdered Cellulose, Natural Flavor, Dried Plain Beet Pulp, Brewers Dried Yeast, Fruit Juice Color, Potassium Chloride, Choline Chloride, Dicalcium Phosphate, Salt, Taurine, DL-Methionine, Calcium Carbonate, Vitamin E Supplement, Zinc Sulfate, Mixed Tocopherols (preservative), Natural Tuna Flavor, Turmeric Color, Citric Acid, Ferrous Sulfate, Copper Sulfate, Vitamin A Supplement, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement (Vitamin B2), Rosemary Extract, Manganese Sulfate, Thiamine Mononitrate (Vitamin B1), D-Calcium Pantothenate (Vitamin B5), Pyridoxine Hydrochloride (Vitamin B6), Vitamin D3 Supplement, Biotin, Potassium Iodide, Folic Acid."},
{"product_name": "PureBites Freeze Dried Chicken Breast Cat Treats, 2.3 oz.", "price_usd": 9.99, "brand_name": "PureBites", "ratings": 4.7, "product_labels": "Cat Treats", "ingredient_formula": "American Sourced Human Grade Chicken Breast."},
{"product_name": "Friskies Party Mix Natural Yums With Real Salmon and Vitamins, Minerals & Nutrients Cat Treats, 6 oz.", "price_usd": 3.84, "brand_name": "Friskies", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Fish, Chicken Meal, Rice, Poultry By-product Meal, Corn Gluten Meal, Animal Fat Preserved With Mixed-tocopherols, Wheat Flour, Natural Flavor, Pea Starch, Barley, Salmon, Dried Yeast, Phosphoric Acid, Malted Barley Extract, Calcium Carbonate, Potassium Chloride, Salt, Choline Chloride, Dehydrated Seaweed Meal, Sunflower Meal, Vitamins (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Dried Carrots, Dried Peas, Minerals (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Taurine, Citric Acid. E623118."},
{"product_name": "Temptations Classic Crunchy and Soft Cat Treats Blissful Catnip Flavor, 3 oz.", "price_usd": 2.58, "brand_name": "Temptations", "ratings": 4.6, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Yellow #5, Blue #2, Choline Chloride, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dried Catnip, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Mixed Tocopherols (Preservative), Natural Salmon Flavor, Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Friskies Party Mix Natural Yums Catnip Flavor Cat Treats, 6 oz.", "price_usd": 3.99, "brand_name": "Friskies", "ratings": 4.8, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Chicken Meal, Brewers Rice, Corn Gluten Meal, Animal Fat Preserved With Mixed-Tocopherols, Natural Flavors, Chicken, Malted Barley Extract, Phosphoric Acid, Calcium Carbonate, Potassium Chloride, Dried Yeast, Salt, Catnip, Choline Chloride, Dehydrated Seaweed Meal, Sunflower Meal, Vitamins (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Dried Carrots, Dried Peas, Minerals (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Taurine, Citric Acid. A623718."},
{"product_name": "Temptations Classic Crunchy and Soft Cat Treats Tempting Tuna Flavor, 6.3 oz.", "price_usd": 3.98, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Caramel Color, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Natural Tuna Flavor, Mixed Tocopherols (Preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "WholeHearted Tuna Recipe Puree Squeezable Cat Treats, 0.5 oz., Count of 4", "price_usd": 2.99, "brand_name": "WholeHearted", "ratings": 4.8, "product_labels": "Cat Treats", "ingredient_formula": "Fish Broth, Tuna, Tapioca Starch, Natural Flavor, Vitamin E Supplement"},
{"product_name": "Temptations Classic Crunchy and Soft Cat Treats Seafood Medley Flavor, 30 oz.", "price_usd": 15.48, "brand_name": "Temptations", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Natural Tuna Shrimp & Salmon Flavor, Red #40, Mixed Tocopherols (Preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Temptations MixUps Crunchy and Soft Cat Treats Catnip Fever Flavor, 16 oz.", "price_usd": 8.48, "brand_name": "Temptations", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Yellow #5, Blue #2, Taurine, Dl-Methionine, Calcium Carbonate, Catnip Powder, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Mixed Tocopherols (Preservative), Red #40, Dried Cheddar Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Friskies Party Mix Natural Yums With Real Chicken & Vitamins, Minerals & Nutrients Cat Treats, 6 oz.", "price_usd": 3.79, "brand_name": "Friskies", "ratings": 4.9, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken, Chicken Meal, Brewers Rice, Poultry By-Product Meal, Corn Gluten Meal, Wheat Flour, Animal Fat Preserved With Mixed-Tocopherols, Pea Starch, Natural Flavor, Barley, Dried Yeast, Phosphoric Acid, Malted Barley Extract, Calcium Carbonate, Potassium Chloride, Salt, Choline Chloride, Dehydrated Seaweed Meal, Sunflower Meal, Vitamins (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Dried Carrots, Dried Peas, Minerals (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Taurine, Citric Acid.E623018."},
{"product_name": "ORIJEN Original Freeze-Dried Cat Treats, 1.25 oz.", "price_usd": 7.39, "brand_name": "ORIJEN", "ratings": 4.7, "product_labels": "Grain Free Cat Treats", "ingredient_formula": "Chicken, turkey, turkey giblets (liver, heart, gizzard), chicken liver, flounder, chicken heart, mixed tocopherols (preservative), citric acid (preservative), rosemary extract."},
{"product_name": "Temptations Classic Crunchy and Soft Cat Treats Savory Salmon Flavor, 30 oz.", "price_usd": 15.48, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Natural Tuna Shrimp & Salmon Flavor, Red #40, Mixed Tocopherols (Preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Feline Greenies Natural Oven Roasted Chicken Flavor Adult Dental Cat Treats, 21 oz.", "price_usd": 22.98, "brand_name": "Greenies", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken Meal, Ground Wheat, Brewers Rice, Corn Gluten Meal, Poultry Fat (Preserved with Mixed Tocopherols), Oat Fiber, Natural Poultry Flavor, Ground Flaxseed, Brewers Dried Yeast, Potassium Chloride, Calcium Carbonate, Salt, Choline Chloride, Citric Acid (a Preservative), Fruit Juice Color, Taurine, DL-Methionine, Mixed Tocopherols (a Preservative), DL-Alpha Tocopherol Acetate (Source of Vitamin E), Ferrous Sulfate, Turmeric Color, Zinc Sulfate, Niacin Supplement, Zinc Oxide, Copper Sulfate, D-Calcium Pantothenate (Vitamin B5), Vitamin A Supplement, Thiamine Mononitrate (Vitamin B1), Manganous Oxide, Riboflavin Supplement (Vitamin B2), Pyridoxine Hydrochloride (Vitamin B6), Biotin, Vitamin B12 Supplement, Vitamin D3 Supplement, Sodium Selenite, Folic Acid, Calcium Iodate, Cobalt Carbonate, Rosemary Extract."},
{"product_name": "Friskies Party Mix Beachside Crunch Cat Treats, 20 oz.", "price_usd": 8.48, "brand_name": "Friskies", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Ocean Whitefish, Chicken Meal, Brewers Rice, Chicken By-Product Meal, Animal Fat Preserved With Mixed-Tocopherols, Pea Starch, Barley, Corn Protein Meal, Liver Flavor, Natural And Artificial Flavors, Cassava Root Flour, Phosphoric Acid, Calcium Carbonate, Potassium Chloride, Brewers Dried Yeast, Shrimp Meal, Crab Meal, Tuna Meal, Choline Chloride, Salt, Taurine, L-Ascorbyl-2-Polyphosphate, MINERALS (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), VITAMINS (Vitamin E Supplement, Niacin, Vitamin A Supplement, Calcium Pantothenate, Thiamine Mononitrate, Riboflavin Supplement, Vitamin B-12 Supplement, Pyridoxine Hydrochloride, Folic Acid, Vitamin D-3 Supplement, Biotin, Menadione Sodium Bisulfite Complex), Yellow 5, Citric Acid, Yellow 6, Red 40, Blue 2, Bha (A Preservative), Bht (A Preservative). I619023."},
{"product_name": "Temptations MixUps Crunchy and Soft Cat Treats Surfer's Delight Flavor, 16 oz.", "price_usd": 8.48, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Natural Tuna Shrimp & Salmon Flavor, Red #40, Mixed Tocopherols (Preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "Tiki Cat Stix Treats Variety Pack, 0.5 oz., Count of 6", "price_usd": 5.49, "brand_name": "Tiki Cat", "ratings": 4.5, "product_labels": "Cat Food Toppers", "ingredient_formula": "WITH CHICKEN IN CREAMY GRAVY INGREDIENTS: Chicken broth, chicken, dried egg, natural tuna flavor, natural chicken flavor, xanthan gum, fish extract, salt. WITH SALMON IN CREAMY GRAVY INGREDIENTS: Salmon broth, salmon, mackerel, dried egg, natural tuna flavor, natural chicken flavor, xanthan gum, fish extract, salt. WITH DUCK IN CREAMY GRAVY INGREDIENTS: Duck broth, duck, chicken, dried egg, natural tuna flavor, natural chicken flavor, xanthan gum, fish extract, salt."},
{"product_name": "Friskies Party Mix Morning Munch Crunch Cat Treats, 2.1 oz.", "price_usd": 1.78, "brand_name": "Friskies", "ratings": 4.9, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Brewers Rice, Chicken By-Product Meal, Beef Fat Preserved With Mixed-Tocopherols, Corn Protein Meal, Animal Liver Flavor, Fish, Natural And Artificial Flavors, Dried Egg Product, Dried Yeast, Phosphoric Acid, Calcium Carbonate, Potassium Chloride, Bacon Flavor, Dried Cheese Powder, Salt, Choline Chloride, Taurine, L-Ascorbyl-2-Polyphosphate (Vitamin C), VITAMINS (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid, Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), MINERALS (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Yellow 5, Citric Acid, Yellow 6, Red 40, Blue 2, Bha (A Preservative), Bht (A Preservative). F619922."},
{"product_name": "Temptations Classics Tasty Chicken Flavor Crunchy and Soft Cat Treats, 30 oz.", "price_usd": 15.48, "brand_name": "Temptations", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Natural Salmon Flavor, Red #40, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid."},
{"product_name": "Whole Hearted Squeezable Puree Cat Treat Variety Pack, 0.5 oz., Count of 6", "price_usd": 4.39, "brand_name": "WholeHearted", "ratings": 4.5, "product_labels": "Cat Treats", "ingredient_formula": "Chicken: Chicken Broth, Chicken, Tapioca Starch, Natural Flavor, Vitamin E Supplement; Tuna: Fish Broth, Tuna, Tapioca Starch, Natural Flavor, Vitamin E Supplement; Salmon: Water Sufficient For Processing, Salmon, Tapioca Starch, Sunflower Oil, Natural Flavor, Guar Gum."},
{"product_name": "Temptations MixUps Crunchy and Soft Cat Treats Backyard Cookout Flavor, 16 oz.", "price_usd": 8.48, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (Preserved With Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors (Source Of Liver Flavor), Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Caramel Color, Salt, Taurine, Dl-Methionine, Calcium Carbonate, Dl-Alpha Tocopherol Acetate (Source Of Vitamin E), Zinc Sulfate, Mixed Tocopherols (Preservative), Natural Beef Flavor, Red #40, Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please Reference Ingredient Image For Complete Ingredient List."},
{"product_name": "WholeHearted Protein-Rich Salmon Filet Cat Treat, 1 oz.", "price_usd": 2.6, "brand_name": "WholeHearted", "ratings": 4.7, "product_labels": "Natural Cat Treats", "ingredient_formula": "Salmon"},
{"product_name": "Temptations Classic Tantalizing Turkey Flavor Cat Treats, 6.3 oz.", "price_usd": 3.98, "brand_name": "Temptations", "ratings": 4.7, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Caramel Color, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Natural Tuna Flavor, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid Please reference ingredient image for complete ingredient list."},
{"product_name": "Tiki Cat Stix Chicken Mousse Cat Treats, 0.5 oz., Count of 6", "price_usd": 4.94, "brand_name": "Tiki Cat", "ratings": 4.6, "product_labels": "Grain Free Cat Treats", "ingredient_formula": "Chicken broth, chicken, dried egg, natural tuna flavor, natural chicken flavor, xanthan gum, fish extract, salt."},
{"product_name": "Temptations Classics Creamy Dairy Flavor Crunchy and Soft Cat Treats, 16 oz.", "price_usd": 8.48, "brand_name": "Temptations", "ratings": 4.9, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Ground Corn, Animal Fat (preserved with Mixed Tocopherols), Brewers Rice, Wheat Flour, Dried Meat By-Products, Natural Flavors, Brewers Dried Yeast, Potassium Chloride, Choline Chloride, Salt, Dried Skim Milk, Taurine, DL-Methionine, Calcium Carbonate, DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Mixed Tocopherols (preservative), Dried Cheese, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid."},
{"product_name": "PureBites Freeze Dried Salmon Cat Treats, 2.0 oz.", "price_usd": 11.59, "brand_name": "PureBites", "ratings": 4.5, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "American Sourced Wild-Caught Human Grade Salmon."},
{"product_name": "Meowijuana Purple Passion Cat Catnip, .917 oz.", "price_usd": 9.99, "brand_name": "Meowijuana", "ratings": 4.4, "product_labels": "Catnip & Cat Grass", "ingredient_formula": "Not Provided"},
{"product_name": "Blue Buffalo Bursts Feline Chicken Liver and Beef Flavour Cat Treats, 12 oz.", "price_usd": 8.98, "brand_name": "Blue Buffalo", "ratings": 4.6, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken Liver, Chicken Meal, Chicken Fat, Brown Rice, Barley, Oatmeal, Tapioca Starch, Natural Flavor, Peas, Deboned Beef, Brewers Dried Yeast, Dried Whey, Pork Fat, Lecithin, DL-Methionine, Taurine, preserved with Citric Acid and Mixed Tocopherols, Dried Cultured Whey, Glucono-Delta-Lactone, Potassium Chloride, Yeast Extract, Oil of Rosemary."},
{"product_name": "PureBites Freeze Dried Minnow Value Size Cat Treats, 2.3 oz.", "price_usd": 11.59, "brand_name": "PureBites", "ratings": 4.5, "product_labels": "Natural Cat Treats", "ingredient_formula": "American Sourced Wild-Caught Human Grade Minnow."},
{"product_name": "Fancy Feast Savory Cravings Limited Ingredient Chicken Flavor Cat Treats, 1 oz.", "price_usd": 2.99, "brand_name": "Fancy Feast", "ratings": 4.4, "product_labels": "Cat Treats", "ingredient_formula": "Liver Flavor, Beef Fat Preserved With Mixed-Tocopherols, Partially Hydrogenated Vegetable Oil, Natural Chicken Flavor. A642521."},
{"product_name": "Fancy Feast Limited Ingredient Savory Cravings Beef & Crab Flavor Cat Treats, 3 oz.", "price_usd": 5.99, "brand_name": "Fancy Feast", "ratings": 4.4, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Liver Flavor, Beef Fat Preserved With Mixed-Tocopherols, Partially Hydrogenated Vegetable Oil, Brewers Dried Yeast, Crab Flavor. A642120."},
{"product_name": "Reveal Natural Grain Free, Real Protein Fillet Whole Tuna Loin Single Ingredient Cat Treats, 1.06 oz.", "price_usd": 2.48, "brand_name": "Reveal", "ratings": 4.8, "product_labels": "Grain Free Cat Treats", "ingredient_formula": "Tuna."},
{"product_name": "Temptations Indoor Control Chicken Flavor Cat Treats, 4.9 oz.", "price_usd": 3.98, "brand_name": "Temptations", "ratings": 4.6, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Chicken By-Product Meal, Animal Fat (preserved with Mixed Tocopherols), Ground Corn, Wheat Flour, Dried Meat By-Products, Brewers Rice, Powdered Cellulose, Natural Flavors, Plain Dried Beet Pulp, Corn Gluten Meal, Potassium Chloride, Choline Chloride, Salt, Taurine, DL-Methionine, Calcium Carbonate, Mixed Tocopherols (preservative), DL-Alpha Tocopherol Acetate (source of Vitamin E), Zinc Sulfate, Copper Sulfate, Vitamin A Acetate, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement, Manganese Sulfate, Thiamine Mononitrate, D-Calcium Pantothenate, Biotin, Vitamin D3 Supplement, Potassium Iodide, Pyridoxine Hydrochloride (Vitamin B6), Folic Acid."},
{"product_name": "Greenies Smartbites Chicken Flavor Healthy Kitten Treats, 2.1 oz.", "price_usd": 3.28, "brand_name": "Greenies", "ratings": 4.8, "product_labels": "Cat Dental Treats & Chews", "ingredient_formula": "Chicken Meal, Brewers Rice, Animal Fat (Preserved with Mixed Tocopherols), Wheat Flour, Animal Plasma, Ground Whole Wheat, Natural Flavors, Fish Oil, Brewers Dried Yeast, Fruit Juice Color, Potassium Chloride, Choline Chloride, Salt, DL-Methionine, Taurine, Calcium Carbonate, Zinc Sulfate, Vitamin E Supplement. Ferrous Sulfate, Mixed Tocopherols (preservative), Copper Sulfate, Vitamin A Supplement, Citric Acid (preservative), Niacin Supplement, Vitamin B-12 Supplement, Riboflavin Supplement (Vitamin B2), Manganese Sulfate, Thiamine Mononitrate (Vitamin B1), D-Calcium Pantothenate (Vitamin B5), Pyridoxine Hydrochloride (Vitamin B6), Vitamin D3 Supplement, Biotin, Potassium Iodide, Folic Acid, Rosemary Extract"},
{"product_name": "Friskies Party Mix Wild West Crunch Cat Treats, 2.1 oz.", "price_usd": 1.78, "brand_name": "Friskies", "ratings": 4.8, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "Brewers Rice, Chicken By-Product Meal, Beef Fat Preserved With Mixed-Tocopherols, Corn Protein Meal, Animal Liver Flavor, Fish, Natural And Artificial Flavors, Dried Yeast, Phosphoric Acid, Calcium Carbonate, Potassium Chloride, Cheese Powder (Source Of Cheddar Cheese Flavor), Salt, Choline Chloride, Taurine, L-Ascorbyl-2-Polyphosphate (Vitamin C), MINERALS (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), VITAMINS (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Yellow 5, Citric Acid, Yellow 6, Red 40, Blue 2, Bha (A Preservative), Bht (A Preservative). H619422."},
{"product_name": "Friskies Party Mix Natural Yums With Real Tuna Cat Treats, 20 oz.", "price_usd": 7.29, "brand_name": "Friskies", "ratings": 4.8, "product_labels": "Soft & Chewy Cat Treats", "ingredient_formula": "Chicken Meal, Brewers Rice, Animal Fat Preserved With Mixed-Tocopherols, Corn Gluten Meal, Natural Flavor, Tuna, Malted Barley Extract, Phosphoric Acid, Calcium Carbonate, Dried Yeast, Salt, Choline Chloride, Dehydrated Seaweed Meal, Sunflower Meal, Cranberries, Vitamins (Vitamin E Supplement, Niacin (Vitamin B-3), Vitamin A Supplement, Calcium Pantothenate (Vitamin B-5), Thiamine Mononitrate (Vitamin B-1), Riboflavin Supplement (Vitamin B-2), Vitamin B-12 Supplement, Pyridoxine Hydrochloride (Vitamin B-6), Folic Acid (Vitamin B-9), Vitamin D-3 Supplement, Biotin (Vitamin B-7), Menadione Sodium Bisulfite Complex (Vitamin K)), Dried Carrots, Dried Peas, Minerals (Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite), Taurine, Citric Acid. E623218."},
{"product_name": "Feline Greenies Natural Savory Salmon Flavor Adult Dental Cat Treats, 21 oz.", "price_usd": 22.98, "brand_name": "Greenies", "ratings": 4.5, "product_labels": "Cat Dental Treats & Chews", "ingredient_formula": "Chicken Meal, Ground Wheat, Brewers Rice, Corn Gluten Meal, Poultry Fat (Preserved with Mixed Tocopherols), Oat Fiber, Natural Poultry Flavor, Salmon Meal, Ground Flaxseed, Brewers Dried Yeast, Potassium Chloride, Calcium Carbonate, Salt, Choline Chloride, Citric Acid (a Preservative), Fruit Juice Color, Taurine, DL-Methionine, Mixed Tocopherols (a Preservative), DL-Alpha Tocopherol Acetate (Source of Vitamin E), Ferrous Sulfate, Turmeric Color, Zinc Sulfate, Niacin Supplement, Zinc Oxide, Copper Sulfate, D-Calcium Pantothenate (Vitamin B5), Vitamin A Supplement, Thiamine Mononitrate (Vitamin B1), Manganous Oxide, Riboflavin Supplement (Vitamin B2), Pyridoxine Hydrochloride (Vitamin B6), Biotin, Vitamin B12 Supplement, Vitamin D3 Supplement, Sodium Selenite, Folic Acid, Calcium Iodate, Cobalt Carbonate, Rosemary Extract."},
{"product_name": "PureBites Freeze Dried Wild-Caught Shrimp Value Size Cat Treats, 0.38 oz.", "price_usd": 4.69, "brand_name": "PureBites", "ratings": 4.5, "product_labels": "Crunchy Cat Treats", "ingredient_formula": "100% Pure Wild-Caught Shrimp"},
{"product_name": "Greenies Smartbites Chicken Flavor Skin & Fur Health Crunchy and Soft Natural Cat Treats, 16 oz.", "price_usd": 19.98, "brand_name": "Greenies", "ratings": 4.8, "product_labels": "Cat Treats", "ingredient_formula": "Chicken Meal, Animal Fat (Preserved with Mixed Tocopherols), Brewers Rice, Ground Whole Wheat, Wheat Flour, Animal Plasma, Natural Flavors, Fish Oil, Brewers Dried Yeast, Potassium Chloride, Whole Flaxseed, Choline Chloride, Dicalcium Phosphate, Fruit Juice (color), Taurine, Salt, DL-Methionine, Calcium Carbonate, Zinc Sulfate, Vitamin E Supplement, Natural Salmon Flavor, Turmeric Oleoresin (color), Citric Acid (Preservative), Ferrous Sulfate, Mixed Tocopherols (Preservative), Copper Sulfate, Vitamin A Supplement, Niacin Supplement, Vitamin B12 Supplement, Riboflavin Supplement (Vitamin B2), Manganese Sulfate, Thiamine Mononitrate (Vitamin B1), D-Calcium Pantothenate, Pyridoxine Hydrochloride (Vitamin B6), Vitamin D3 Supplement, Biotin, Potassium Iodide, Folic Acid, Rosemary Extract. Please reference ingredient image for complete ingredient list."}
]